#Ввод данных
print('Хотите рассчитать матрицу судьбы? "да" или "нет"?')
otvet = input()
if otvet == 'нет':
	print('Возвращайтесь, когда передумаете!')
while otvet == 'да':
	print('Пример: 07, декабрь, 2008')
	print('Напишите день: ')
	day = input()
	print('Напишите месяц: ')
	month = input()
	print('Напишите год: ')
	year = input()

	#Преобразование данных
	months = {'январь': '01', 'февраль': '02', 'март': '03', 'апрель': '04', 'май': '05', 'июнь': '06',
			  'июль': '07', 'август': '08', 'сентябрь': '09', 'октябрь': '10', 'ноябрь': '11', 'декабрь': '12'}
	month = months[month]
	if int(day) < 10:
		day = day[1] + day[0]
	while len(year) < 4:
		year += '0'

	#Считание матрицы
	number_1 = str(int(day[0]) + int(day[1]) + int(month[0]) + int(month[1]) + int(year[0]) + int(year[1]) + int(year[2]) + int(year[3]))
	while len(number_1) < 2:
		number_1 += '0'
	number_2 = str(int(number_1[0]) + int(number_1[1]))
	while len(number_2) < 2:
		number_2 += '0'
	number_3 = str(int(number_1) - int(str(day)[0]) * 2)
	while len(number_3) < 2:
		number_3 += '0'
	number_4 = str(int(number_3[0]) + int(number_3[1]))
	data = str(day) + str(month) + str(year)
	list_ = number_1 + number_2 + number_3 + number_4 + data

	one = list_.count('1') * '1'
	two = list_.count('2') * '2'
	three = list_.count('3') * '3'
	four = list_.count('4') * '4'
	five = list_.count('5') * '5'
	six = list_.count('6') * '6'
	seven = list_.count('7') * '7'
	eight = list_.count('8') * '8'
	nine = list_.count('9') * '9'

	if one == '':
		one = 'нет 1'
	if two == '':
		two = 'нет 2'
	if three == '':
		three = 'нет 3'
	if four == '':
		four = 'нет 4'
	if five == '':
		five = 'нет 5'
	if six == '':
		six = 'нет 6'
	if seven == '':
		seven = 'нет 7'
	if eight == '':
		eight = 'нет 8'
	if nine == '':
		nine = 'нет 9'

	#Выравнивание элементов по длине
	len_ = len(max(one, two, three, four, five, six, seven, eight, nine)) * 3 + 10

	#Выравнивание элементов по ширине
	column_1 = int(len(max(one, two, three)))
	column_2 = int(len(max(four, five, six)))
	column_3 = int(len(max(seven, eight, nine)))
	column = max(column_1, column_2, column_3)

	#Составление квадрата
	print('-' * len_)
	print(f'| {one:^{column}} | {four:^{column}} | {seven:^{column}} |')
	print('-' * len_)
	print(f'| {two:^{column}} | {five:^{column}} | {eight:^{column}} |')
	print('-' * len_)
	print(f'| {three:^{column}} | {six:^{column}} | {nine:^{column}} |')
	print('-' * len_)

	#Расшифровка матрицы
	if one != 'нет 1' and int(one) >= 111111:
		one = '111111'
	if two != 'нет 2' and int(two) >= 2222:
		two = '2222'
	if three != 'нет 3' and int(three) >= 333:
		three = '333'
	if four != 'нет 4' and int(four) >= 444:
		four = '444'
	if five != 'нет 5' and int(five) >= 5555:
		five = '5555'
	if six != 'нет 6' and int(six) >= 6666:
		six = '6666'
	if seven != 'нет 7' and int(seven) >= 7777:
		seven = '7777'
	if eight != 'нет 8' and int(eight) >= 8888:
		eight = '8888'
	if nine != 'нет 9' and int(nine) >= 9999:
		nine = '9999'

	print('Цифра 1 — характер человека, его способность отстаивать свои интересы, а также степень желания властвовать.' + '\n' +
		  'Цифра 2 — энергия человека. Его активность в социуме: в семье, на работе, в обществе. ' + '\n' +
		  'Цифра 3 — интерес человека к наукам. И прежде всего речь идет о точных науках или увлечении техникой. Также по тройке можно судить о порядочности.' + '\n' +
		  'Цифра 4 — отвечает за здоровье. ' + '\n' +
		  'Цифра 5 — логика и интуиция. Способность строить планы, анализировать ситуацию, делать правильные выводы. ' + '\n' +
		  'Цифра 6 — склонность человека к физическому труду.' + '\n' +
		  'Цифра 7 — везение и удача. ' + '\n' +
		  'Цифра 8 — чувство долга (в первую очередь по отношению к родным и близким).' + '\n' +
		  'Цифра 9 — память, ум, а также интуиция и ясновидение.')
	print()
	spisok = {'нет 1': 'Нет цифры 1. Встречается только у людей, рожденных после 2000 года. Считает, что, мир крутится вокруг него и все ему чем-то обязаны. Важно еще в раннем детстве избавлять его от ощущения своей неповторимости и особенности, предпочтительнее воспитание в коллективе.',
			  '1': 'Перед нами типичный эгоист. Свои интересы ставит превыше всего.',
			  '11': 'Близок к типичному эгоисту. Самодовольство и самовосхваление.',
			  '111': 'Золотая середина. Уравновешенный человек',
			  '1111': 'Сильный характер. Решительность и действенность',
			  '11111': 'Диктатор',
			  '111111': 'Достаточно жесток, сложный характер. Но способен совершить благородный поступок.',
			  'нет 2': 'Нет цифры 2. Это энергетические вампиры в хорошем смысле слова. Они открыты для общения, подпитываются от окружающих новыми идеями и впечатлениями.',
			  '2': 'Достаточно своей энергии, однако для поддержания баланса рекомендуются занятия спортом.',
			  '22': 'Золотая середина. Баланс и гармония. Своей энергией с радостью делится с окружающими.',
			  '222': 'Из него может получиться неплохой экстрасенс. Есть смысл развивать интуицию.',
			  '2222': 'Пользуется популярностью у противоположного пола за счет своей активности и непосредственности. Особенно привлекателен для людей с тремя шестерками в квадрате.',
			  'нет 3': 'Нет цифры 3. Встречается только у людей, рожденных после 2000 года. Считает, что, мир крутится вокруг него и все ему чем-то обязаны. Важно еще в раннем детстве избавлять его от ощущения своей неповторимости и особенности, предпочтительнее воспитание в коллективе.',
			  '3': 'Перед нами типичный эгоист. Свои интересы ставит превыше всего.',
			  '33': 'Близок к типичному эгоисту. Самодовольство и самовосхваление.',
			  '333': 'Золотая середина. Уравновешенный человек.',
			  'нет 4': 'Нет цифры 4. Это энергетические вампиры в хорошем смысле слова. Они открыты для общения, подпитываются от окружающих новыми идеями и впечатлениями.',
			  '4': 'Достаточно своей энергии, однако для поддержания баланса рекомендуются занятия спортом.',
			  '44': 'Золотая середина. Баланс и гармония. Своей энергией с радостью делится с окружающими.',
			  '444': 'Из него может получиться неплохой экстрасенс. Есть смысл развивать интуицию.',
			  'нет 5': 'Нет цифры 5. Его мозг всегда в работе. Он что-то придумывает, что-то доказывает, в том числе и самому себе. Методом проб и ошибок достигает поставленной цели.',
			  '5': 'Интуиция развита. В жизни все дается легко.',
			  '55': 'Хорошая интуиция. Главное к ней прислушиваться. Часто из обладателей двух пятерок получаются грамотные следователи и юристы.',
			  '555': 'Совершить ошибку для них редкость, ведь они почти ясновидящие. Судьба постоянно посылает им знаки свыше. А они умело пользуются подсказками.',
			  '5555': 'У этих людей есть все шансы сделать экстрасенсорику своей профессией. Они способны видеть будущее. Им снятся вещие сны, а также быстро приходят ответы на интересующие вопросы.',
			  'нет 6': 'Нет цифры 6. Предназначение человека — физический труд. Нередко про таких говорят «золотые руки». Из них получаются неплохие ремесленники, плотники, маляры. Единственное, занятие физическим трудом не всегда приносит им удовольствие.',
			  '6': 'Обладателю одной шестерки делать что-то своими руками необходимо, однако ему предоставляется возможность найти себя и в другой сфере деятельности.',
			  '66': 'В этом случае заниматься физическим трудом не обязательно, но обладатели двух шестерок любят мастерить что-то своими руками. Однако в данном случае это скорее хобби, чем профессия.',
			  '666': 'На них можно рассчитывать. Добросовестно выполняют свою работу. Но им необходима подпитка. Чаще всего энергию берут у партнера с большим количеством двоек в матрице.',
			  '6666': 'Настоящий работяга. Ему сложно сидеть без дела. Всегда должен чем-то заниматься, при этом получает от этого огромное удовольствие. Если в квадрате еще и девятки, есть смысл получить высшее образование, уравновесив чрезмерную активность.',
			  'нет 7': 'Нет цифры 7. Жизнь будет сложной, всего придется добиваться собственным трудом, учиться на своих ошибках. Не исключено отрешение от мирской жизни и уход в религию.',
			  '7': 'Жизнь протекает легко. Но ярких ее проявлений и крутых поворотов в судьбе ждать не стоит.',
			  '77': 'Они талантливы. Есть возможность стать известным художником или музыкантом. Однако, если не развиваться в профессии или творчестве, плюс может легко поменяться на минус. Ведь этим людям с легкостью дается не только хорошее, но и плохое.',
			  '777': 'Насыщенная яркими событиями жизнь. Нередко увлекаются экстремальными видами спорта. Риск не пугает их, а скорее манит. Однако есть смысл периодически сбавлять обороты и давать себе передышку.',
			  '7777': 'Чаще всего обладатели четырех семерок не приспособлены к жизни. Увы, их жизненный путь недолог. И даже если они остаются на земле, их постоянно преследуют болезни.',
			  'нет 8': 'Нет цифры 8. Не ждите от него пожертвований. Он с удовольствием будет принимать помощь и поддержку со стороны. А вот ставить интересы других выше своих собственных вряд ли сможет.',
			  '8': 'На него можно положиться. Всегда готов оказать поддержку.',
			  '88': 'Ощущение, что желание помогать заложено у него в генах. Стоит только попросить, как он бросит свои дела и уделит вам внимание.',
			  '888': 'Обладатель трех восьмерок охватывает заботой не только своих близких и друзей, но и всех нуждающихся. Неравнодушен к страданию народа, готов пойти на жертвы, чтобы добиться справедливости.',
			  '8888': 'Перед нами талантливый психолог, которому не надоедает выслушивать, проявлять заботу и милосердие. В то же время обладает тягой к точным наукам.',
			  'нет 9': 'Нет цифры 9. Отсутствие девятки может быть только у появившихся на свет после 2000 года. С самого рождения надо начинать развивать память и логику, чтобы уже к школе восполнить пустующий квадрат.',
			  '9': 'Заставляйте свой мозг постоянно работать. Разгадывайте кроссворды, учите стихи. Если второй девятки нет в матрице, ее надо отрабатывать.',
			  '99': 'У обладателей двух девяток с умственными способностями все в порядке. Есть все данные для успешного развития. Но необходимо постоянно работать, просто так ничего не дается.',
			  '999': 'А вот здесь запаса ума хватает на то, чтобы прилагать минимум усилий для хорошей учебы и успешной карьеры. Таким людям все дается легко.',
			  '9999': 'Им открывается истина. Они практически на сто процентов защищены от провала в любом начинании. Возможно потому, что для них все очень просто, они жестоки, неприятны в общении, смотрят на всех свысока и часто бывают неадекватны.'}
	print(f'{one}: {spisok[one]}' '\n'
		  f'{two}: {spisok[two]}' '\n'
		  f'{three}: {spisok[three]}' '\n'
		  f'{four}: {spisok[four]}' '\n'
		  f'{five}: {spisok[five]}' '\n'
		  f'{six}: {spisok[six]}' '\n'
		  f'{seven}: {spisok[seven]}' '\n'
		  f'{eight}: {spisok[eight]}' '\n'
		  f'{nine}: {spisok[nine]}')
	print('Хотите ещё раз рассчитать матрицу судьбы? "да" или "нет"?')
	otvet = input()
	if otvet == 'нет':
		print('Возвращайтесь, когда передумаете!')
